ANSI-Common-LISP/docs/exercise-12.md


# exercise-12

1.  [Draw three different trees that&#x2026;](#org880db99)
2.  [Assuming make-queue,&#x2026;](#orge3b4c28)
3.  [Define a function `copy-queue` that returns a copy of a queue.](#org0e07fbc)
4.  [Define a function that&#x2026;](#org4625127)
5.  [Define a function that&#x2026;](#orgccc5d21)
6.  [efine a function that&#x2026;](#org7e1f9ff)
7.  [Define a function that&#x2026;](#org224ca71)
8.  [Define a function that&#x2026;](#orgea69cd2)


<a id="org880db99"></a>

## Draw three different trees that&#x2026;

1.Draw three different trees that would print as ((A) (A) (A)). Write an expression that generates each.

    (cons (cons 'a nil) (cons (cons 'a nil) (cons (cons 'a nil) nil)))
    
    (make-array '(3 1) :initial-element 'a)
    
    (vector '(a) '(a) '(a))


<a id="orge3b4c28"></a>

## Assuming make-queue,&#x2026;

2.Assuming `make-queue`, `enqueue`, and `dequeue` are defined as in Figure 12.7, draw the queue in box-notation after each step:

    (defun make--queue () (cons nil nil))
    
    (defun enqueue (obj q)
      (if (null (car q))
          (setf (cdr q) (setf (car q) (list obj)))
          (setf (cdr (cdr q)) (list obj)
                (cdr q) (cdr (cdr q))))
      (car q))
    
    (defun dequeue (q)
      (pop (car q)))

    ;;> (setf q (make-queue)) ==> (NIL)

<!-- This HTML table template is generated by emacs 28.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      nil
    </td>
    <td align="left" valign="top">
      nil
    </td>
  </tr>
</table>

    ;;> (enqueue 'a q) ==> (A)

<!-- This HTML table template is generated by emacs 28.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>

    ;;> (enqueue 'b q) ==> (A B)

<del>---</del>&#x2014;+

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<del>-</del>-<del>-</del>-+

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left"><del>---------</del></td>
</tr>
</tbody>
</table>

<del>-</del>-<del>----</del>  <del>---</del>&#x2014;+

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-left"><del>--</del> b</td>
<td class="org-left">nil</td>
</tr>
</tbody>
</table>

<del>---</del>-&#x2014;+  <del>---</del>&#x2014;+

    ;;> (dequeue q) ==> A

<!-- This HTML table template is generated by emacs 28.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;a&nbsp;
    </td>
  </tr>
</table>


<a id="org0e07fbc"></a>

## Define a function `copy-queue` that returns a copy of a queue.

    (defun copy-queue (q)
      (if (null (car q))
          nil
          (list (cons (car (car q))
                      (copy-queue  (list (cdr (car q)) (cdr q))))
                (cdr q))))


<a id="org4625127"></a>

## Define a function that&#x2026;

4.Define a function that takes an object and a queue, and puts the object on the *front* of the queue.


<a id="orgccc5d21"></a>

## Define a function that&#x2026;

5.Define a function that takes an object and a queue, and (destructively) moves the first (`eql`) instance of the object to the front of the queue.


<a id="org7e1f9ff"></a>

## efine a function that&#x2026;

6.Define a function that takes an object and a possibly cdr-circular list, and returns true if the object is a member of the list.


<a id="org224ca71"></a>

## Define a function that&#x2026;

7.Define a function that returns true when its argument is a cdr-circular list.


<a id="orgea69cd2"></a>

## Define a function that&#x2026;

8.Define a function that returns true when its argument is a car-circular list.

